{
  "version": "2.0",
  "total_chunks": 87,
  "campaign_name": "Reigen's Log",
  "chunks": [
    {
      "id": "pc-reigen-001",
      "type": "player_character",
      "character": "Reigen Arlondwright",
      "summary": "Changeling exorcist and infiltrator",
      "content": "Reigen Arlondwright is a Changeling exorcist who hides his race due to systemic racism. He operates undercover as a GalaxyBucks employee while secretly infiltrating the corporation to dismantle it from within. Signature abilities include identity spells, silvery barbs, phantasmal force, and mass business card distribution. His primary income comes from exorcising 'spirits' (usually just rich people's problems). Notable feats: exorcised Frank's wife multiple times (she was just sick of Frank), successfully impersonated Geeves during the Lincoln Station heist, and used mass suggestion to calm panicked monorail passengers. He has a talent for comforting people through shoulder massages that double as identity spell casts. His catchphrase is offering retainers that no one signs. Currently wanted for kidnapping (false charge) by Rodina authorities after the Traveler rescue.",
      "metadata": {
        "characters": ["Reigen", "Frank", "Johnny", "Gloria", "GalaxyBucks CEO"],
        "locations": ["Lincoln Station", "Rodina", "Cupie", "Sulfur"],
        "factions": ["GalaxyBucks", "Fathom Ink", "Rebis"],
        "quest_id": "infiltrate-galaxybucks",
        "episode": 1,
        "tokens": 156
      },
      "cross_references": ["pc-johnny-001", "npc-gloria-001", "plot-lincoln-001", "plot-rodina-001"]
    },
    {
      "id": "pc-johnny-001",
      "type": "player_character",
      "character": "Johnny Mythrilhand",
      "summary": "90-year-old gunslinger with resurrected consciousness",
      "content": "Johnny Mythrilhand is a 90+ year old human whose consciousness was killed by Ultimum Inc 100 years ago and preserved as an AI. His consciousness currently inhabits a body saved by Hank (H.A.N.K. AI). Cybernetic left arm (the 'Mythrilhand') with modular weapon attachments. Warlock with Alt as his AI patron who manifests as a solid woman he can feel since she gained admin access to Afrodite system. Famous whistleblower who exposed Ultimum Inc's raid on Rebis labs, forcing them to become a criminal organization. Carries deep guilt over his girlfriend's death (Eve Stabber's sister). Known aliases include 'The Incident.' Can enter a 'cyberpunk trance' to speak with Alt. Has a signature drink called the 'Johnny Mythrilhand Special.' Despite being dead inside, he's the party's moral compass. Expert gymnast even when drunk. Currently investigating the Cult of the Sun's involvement with Rebis.",
      "metadata": {
        "characters": ["Johnny", "Alt", "Eve Stabber", "Hank", "Ultimum Inc"],
        "locations": ["Apatia", "Lincoln Station", "Rodina"],
        "factions": ["Fathom Ink", "Ultimum Inc", "Banana Guards"],
        "quest_id": "rebis-whistleblower",
        "episode": 1,
        "tokens": 142
      },
      "cross_references": ["pc-reigen-001", "npc-ultimum-001", "artifact-hankai-001"]
    },
    {
      "id": "pc-chimer-001",
      "type": "player_character",
      "character": "Chimer",
      "summary": "2,500-year-old last of his kind",
      "content": "Chimer appears 25 but is actually 2,500 years old according to Hero Corps scanner. His blood contains ancestral genes connecting to every race. The last of his species that built the March civilization. Druid/Warlock hybrid with Witchbolt trauma (accidentally killed childhood pet with it). Military father (different species) from Niniche. Has recurring flashbacks of being in green embryonic fluid vats in Rebis labs. His body bears glowing symbols during combat. Familiar is a psionic cat named Yippee. Has a restraining order from Goldstein (publicly 'dead' after Aphrodite attack). Father is currently in cardiac arrest on Niniche. Wants to find others like him. The Traveler recognized him but refused to explain the connection. Bears the Rubedo symbol on his body that matches Rebis artifacts.",
      "metadata": {
        "characters": ["Chimer", "Neal Ferguson", "Goldstein", "Father", "Yippee"],
        "locations": ["Niniche", "Sulfur Feywild", "Rebis Lab"],
        "factions": ["Rebis"],
        "quest_id": "origin-mystery",
        "episode": 1,
        "tokens": 138
      },
      "cross_references": ["pc-chimer-002", "npc-rebis-001", "artifact-rubedo-001", "plot-niniche-001"]
    },
    {
      "id": "pc-hui-001",
      "type": "player_character",
      "character": "Hui Newton",
      "summary": "Android created by Newton, looks identical to his creator",
      "content": "Hui Newton is an android created by Newton (deceased Rebis scientist) as his final creation. Looks identical to his creator, which causes Gloria to call him 'handsome.' Technomancer/Artificer with progressive robot companions: Mewtwo → Mewthree → Mewfour (currently damaged). Quest is to learn to take Gloria's place as Rebis 'Brain.' Has admin access to Afrodite system after Chimer cracked the password (VENUS). Expert hacker who can sabotage barriers, communications, and robot commands. Taught by Gloria to manipulate solar flares. Can perform branding smite on himself. Created EMPs, rigged fighting pit smoke systems, and built a fortune-telling machine. Currently rebuilding Mewfour after feywild battle. Received clearance to enter Rodina from Gloria via hamster race bet.",
      "metadata": {
        "characters": ["Hui", "Newton", "Mewtwo", "Mewthree", "Mewfour", "Gloria", "Pailor"],
        "locations": ["Rodina", "Sulfur", "Lincoln Station"],
        "factions": ["Rebis", "Banana Guards"],
        "quest_id": "become-rebis-brain",
        "episode": 1,
        "tokens": 134
      },
      "cross_references": ["npc-gloria-001", "npc-rebis-001", "plot-rodina-001", "artifact-albedo-001"]
    },
    {
      "id": "pc-tabaga-001",
      "type": "player_character",
      "character": "Tabaga",
      "summary": "Wrestler from Cupie, parents created dating app",
      "content": "Tabaga is an Orc/Goliath hybrid wrestler from Cupie's jungle city. Parents created rival dating app to Cupid's Arrow and are deceased. House was condemned by Marcus (family friend). Signature move: throwing rotten apples with deadly accuracy. Signature war cry: 'Shamandar!' Currently publicly 'dead' after Aphrodite assassination attempt, which she faked. Goldstein jumped in front of bullet meant for her (scripted). Has restraining order from Goldstein but now uneasy allies. Accepted spider familiar (Snoopy the Destroyer) into her cleavage. Defeated mech alongside Goldstein after Aphrodite takedown. Parents' dating app was legitimate competitor to Cupid's Arrow's exploitative model. Plans to take down Goldstein but now sees he's also trapped by Aphrodite.",
      "metadata": {
        "characters": ["Tabaga", "Goldstein", "Parents", "Marcus", "Snoopy"],
        "locations": ["Cupie", "Lincoln Station"],
        "factions": ["Cupid's Arrow", "Fighting Association"],
        "quest_id": "tabaga-resurrection",
        "episode": 1,
        "tokens": 128
      },
      "cross_references": ["npc-goldstein-001", "plot-cupie-001", "npc-snoopy-001"]
    },
    {
      "id": "pc-bob-001",
      "type": "player_character",
      "character": "Bob",
      "summary": "Plasmoid spy with generational ship origin",
      "content": "Bob is a Plasmoid spy with handler Elizabeth. Gained consciousness watching families on generational ship. Master of vent infiltration and psychic daggers. Can create psychic daggers that function as stairs. Current missions: ruin DJ Smooch.exe's career and assassinate Tabaga (plans to fail both). Shimana Clan noticed him when he wrestled a wolf on asteroid. Creates extremely believable disguises (cat form most common). Preaches 'Dishwasher God' religion started at Lincoln Station. Has spy network access. Psychic link with party. Received 2000 gold for Lincoln Station job. Currently planning to sabotage his own assassination contract on Tabaga. His origin story involves watching a mother ask daughter to get something from fridge—implied family tragedy.",
      "metadata": {
        "characters": ["Bob", "Elizabeth", "Tabaga", "DJ Smooch.exe", "Shimana Clan"],
        "locations": ["Lincoln Station", "Shimana Asteroid"],
        "factions": ["Spy Network", "Shimana Clan"],
        "quest_id": "spy-missions",
        "episode": 1,
        "tokens": 132
      },
      "cross_references": ["pc-tabaga-001", "npc-shimana-001", "plot-smooch-001"]
    },
    {
      "id": "npc-frank-001",
      "type": "recurring_client",
      "character": "Frank",
      "summary": "Rich eccentric with spirit-possessed wife",
      "content": "Frank is a wealthy eccentric who repeatedly hires Reigen to exorcise spirits from his wife. The 'spirit' is actually his wife being sick of Frank's behavior. Paid for Reigen's luxury transport ship vacation. Appeared unexpectedly at Lincoln Station gambling hall. Source of surveillance system fault (cheating device). Has gambling problem using cheating device that Hui later used to stop robot. His wife is fine—just sick of his shit.",
      "metadata": {
        "characters": ["Frank", "Frank's Wife", "Reigen"],
        "locations": ["Lincoln Station"],
        "factions": [],
        "quest_id": "frank-exorcism",
        "episode": 1,
        "tokens": 68
      },
      "cross_references": ["pc-reigen-001", "plot-lincoln-001"]
    },
    {
      "id": "npc-sasafrazz-001",
      "type": "destroyed_robot",
      "character": "Mr. Sasafrazz",
      "summary": "Robot whose destruction revealed Revis plot",
      "content": "Mr. Sasafrazz was a security robot on the oddjobers transport ship. Killed by Thelian Rimane (revealed when helmet knocked off). His destruction revealed the egg-shaped station to the passengers. From his destroyed body emerged Bob (plasmoid), who had been riding inside. His murder was used by Hui to blackmail Thelian. Johnny knew him as typical superstar jerk. Post-death, his 'autograph' was taken by scientist.",
      "metadata": {
        "characters": ["Sasafrazz", "Thelian Rimane", "Bob", "Johnny"],
        "locations": ["Transport Ship"],
        "factions": [],
        "quest_id": "sasafrazz-death",
        "episode": 1,
        "tokens": 61
      },
      "cross_references": ["pc-bob-001", "npc-thelian-001", "plot-revis-001"]
    },
    {
      "id": "npc-thelian-001",
      "type": "antagonist_minor",
      "character": "Thelian Rimane",
      "summary": "Murderer blackmailed by Hui",
      "content": "Thelian Rimane is the person who shot Mr. Sasafrazz in the head. Hui broadcast the murder footage into his hotel room bedroom to blackmail him. Thelian fled his room and escaped. He was the source of surveillance system fault at Lincoln Station. Later revealed to be stuck on the Marlin for a day, talking to a broom with face drawn on it. Thillian Romain variant appears in different sections—likely same person.",
      "metadata": {
        "characters": ["Thelian", "Hui", "Sasafrazz"],
        "locations": ["Lincoln Station", "Marlin"],
        "factions": [],
        "quest_id": "thelian-blackmail",
        "episode": 1,
        "tokens": 59
      },
      "cross_references": ["npc-sasafrazz-001", "pc-hui-001"]
    },
    {
      "id": "npc-bosh-001",
      "type": "rebis_member",
      "character": "Bosh Kyros (The Host)",
      "summary": "Rebis founder, cyborg bioresearch director",
      "content": "Bosh Kyros is the 'Host' and founder of Rebis, created to save the universe. Runs a bioresearch station where extinct animals are resurrected. Became a cyborg. Mistook party for actual oddjobers and requested off-books job. Gave them schematics showing Revis wasn't just a company name but an unfinished machine needing 4 parts. In Rebis team photo with Gloria and Newton (human version). Has been genetically modifying animals and releasing them to wild. Adopted Emily after her parents' death. Escaped Ultimum raid with Xenathel's sacrifice. Currently at large.",
      "metadata": {
        "characters": ["Bosh", "Emily", "Gloria", "Newton", "Xenathel"],
        "locations": ["Bioresearch Station"],
        "factions": ["Rebis", "Ultimum Inc"],
        "quest_id": "rebis-foundation",
        "episode": 1,
        "tokens": 95
      },
      "cross_references": ["npc-rebis-001", "npc-emily-001", "artifact-revis-001"]
    },
    {
      "id": "npc-gloria-001",
      "type": "rebis_member",
      "character": "Gloria Slugbottom",
      "summary": "Mechanic, legal clone, barrier machine operator",
      "content": "Gloria Slugbottom is the 'Mechanic' of Rebis. One of only two people legally allowed to be cloned (along with Mark). Chronic smoker and hamster race gambler. On Rodina working on barrier machine. Has clone Edna (younger, military). Wires into medical equipment. Wants Hui to take her place as Rebis 'Brain' but thinks he's not ready. Bet Hui that if his hamster won, she'd let him into Rodina. Gave him invitation after cigarette hamster victory. Told Hui about Newton's work with Rebis and abandonment of underwater HQ on Apatia. Warned him he looks like Newton. Smokes 'morning glory' weed. Knew Emily was tabaxi ninja but didn't reveal. Currently frail with IV bags.",
      "metadata": {
        "characters": ["Gloria", "Edna", "Mark", "Hui", "Newton", "Emily"],
        "locations": ["Rodina", "Apatia"],
        "factions": ["Rebis"],
        "quest_id": "locator-acquisition",
        "episode": 3,
        "tokens": 118
      },
      "cross_references": ["pc-hui-001", "artifact-albedo-001", "npc-emily-001"]
    },
    {
      "id": "pc-hui-001",
      "type": "player_character",
      "character": "Hui Newton",
      "summary": "Android created by Newton, looks identical to his creator",
      "content": "Hui Newton is an android created by Newton (deceased Rebis scientist) as his final creation. Looks identical to his creator, which causes Gloria to call him 'handsome.' Technomancer/Artificer with progressive robot companions: Mewtwo → Mewthree → Mewfour (currently damaged). Quest is to learn to take Gloria's place as Rebis 'Brain.' Has admin access to Afrodite system after Chimer cracked the password (VENUS). Expert hacker who can sabotage barriers, communications, and robot commands. Taught by Gloria to manipulate solar flares. Can perform branding smite on himself. Created EMPs, rigged fighting pit smoke systems, and built a fortune-telling machine. Currently rebuilding Mewfour after feywild battle. Received clearance to enter Rodina from Gloria via hamster race bet.",
      "metadata": {
        "characters": ["Hui", "Newton", "Mewtwo", "Mewthree", "Mewfour", "Gloria", "Pailor"],
        "locations": ["Rodina", "Sulfur", "Lincoln Station"],
        "factions": ["Rebis", "Banana Guards"],
        "quest_id": "become-rebis-brain",
        "episode": 1,
        "tokens": 134
      },
      "cross_references": ["npc-gloria-001", "npc-rebis-001", "plot-rodina-001", "artifact-albedo-001"]
    },
    {
      "id": "npc-edna-001",
      "type": "clone",
      "character": "Edna",
      "summary": "Gloria's combat-ready clone",
      "content": "Edna is Gloria Slugbottom's younger, military-styled clone. Acts as bodyguard and assistant. Wore stilettos and military uniform when first meeting Hui. Can create sword from her own blood. Fought Emily the tabaxi ninja alongside party. Uses grappling hooks and has enhanced speed. Helped party navigate Rodina barrier facility. Vapes instead of smokes. Deeply loyal to Gloria. One of only two legally cloned people (with Mark).",
      "metadata": {
        "characters": ["Edna", "Gloria", "Emily"],
        "locations": ["Rodina"],
        "factions": ["Rebis"],
        "quest_id": "clone-protection",
        "episode": 3,
        "tokens": 67
      },
      "cross_references": ["npc-gloria-001", "npc-emily-001"]
    },
    {
      "id": "npc-mump-001",
      "type": "antagonist_major",
      "character": "Mump Mellon",
      "summary": "Co-owner of Lincoln Station, creator of Debt Star",
      "content": "Mump Mellon is co-owner of Lincoln Station with Cornelius Figg. Large-set man with little moustache and bowler hat. Sits on floating chair doing calculations. Archenemy of Cornelius (pretend rivalry). Created 'Debt Star'—moon-like structure to collapse economies, one year from completion. Uses refugee/slave labor. Took food orders from party while waiting for Host. Ordered Johnny killed thinking he was there to assassinate Eve Stabber. Arrested after Lincoln Station heist. Spent 20 million gold on refugees/slaves. Had bulletproof vest and friendly microchip technology.",
      "metadata": {
        "characters": ["Mump Mellon", "Cornelius Figg", "Eve Stabber", "Johnny"],
        "locations": ["Lincoln Station"],
        "factions": [],
        "quest_id": "lincoln-heist",
        "episode": 1,
        "tokens": 88
      },
      "cross_references": ["npc-cornelius-001", "plot-lincoln-001", "artifact-debtstar-001"]
    },
    {
      "id": "npc-cornelius-001",
      "type": "antagonist_major",
      "character": "Cornelius Figg",
      "summary": "Co-owner of Lincoln Station, fighting pit enthusiast",
      "content": "Cornelius Figg is co-owner of Lincoln Station. Wears green suit with thin goatee. Surrounds himself with women. Loves gambling on fighting pits—bets on people's lives. Ordered Johnny to rig fight so CJ would lose. Bought equipment from fighting pit store. Suggested turning station into resort (opposed by Mump). Arrested after heist. Has chart with all Johnny's aliases including 'The Incident.' Wore bulletproof vest at Aphrodite attack. Currently on public trial. Has nephew Hasan on Sulfur.",
      "metadata": {
        "characters": ["Cornelius Figg", "Mump Mellon", "Johnny", "CJ", "Hasan"],
        "locations": ["Lincoln Station"],
        "factions": [],
        "quest_id": "lincoln-heist",
        "episode": 1,
        "tokens": 79
      },
      "cross_references": ["npc-mump-001", "plot-lincoln-001", "npc-hasana-001"]
    },
    {
      "id": "npc-eve-001",
      "type": "antagonist_boss",
      "character": "Eve Stabber",
      "summary": "Cybernetic muscle hired to protect Lucky Lincoln",
      "content": "Eve Stabber is an 8-foot tall muscular woman with high-quality cybernetics and robot arm. Hired as extra muscle to protect Lucky Lincoln. Arms split in half to wield four guns. Sister of Johnny's dead girlfriend. Looking for Johnny Mythrilhand. Reigen poisoned her with diluted poison in sandwiches—she ate both. Hexed by Johnny during coin toss. Survived point-blank gunshot to head (armor). Knew Johnny's reputation (piece of shit who got his girlfriend killed). Retreated wounded. Working for Ultimum Inc under different contract. Presumed alive.",
      "metadata": {
        "characters": ["Eve Stabber", "Johnny", "Mump Mellon", "Reigen"],
        "locations": ["Lincoln Station"],
        "factions": ["Ultimum Inc"],
        "quest_id": "lincoln-heist",
        "episode": 1,
        "tokens": 82
      },
      "cross_references": ["pc-johnny-001", "npc-mump-001", "plot-lincoln-001"]
    },
    {
      "id": "npc-goldstein-001",
      "type": "rival_antagonist",
      "character": "Goldstein",
      "summary": "Wrestling rival, Cupid's Arrow representative",
      "content": "Goldstein is Tabaga's wrestling rival and Cupid's Arrow representative on Cupie. Massive man barely fitting in suits, white goatee, booming smile. Arch-nemesis of Tabaga, bought her house for demolition. Dating app rival to Tabaga's parents. Scripted to 'save' Tabaga during Aphrodite attack but actually took bullet. Now publicly 'dead' with Tabaga. Wants to collaborate and revive her family legacy. Has uncle who buys second-most slaves/refugees from Lincoln Station and frees them on Apatia. Against spirit doping. Has restraining order against Tabaga but now allies. Presumed dead to public.",
      "metadata": {
        "characters": ["Goldstein", "Tabaga", "Aphrodite", "Uncle"],
        "locations": ["Cupie", "Lincoln Station"],
        "factions": ["Cupid's Arrow"],
        "quest_id": "tabaga-resurrection",
        "episode": 2,
        "tokens": 86
      },
      "cross_references": ["pc-tabaga-001", "npc-ladyvera-001", "plot-cupie-001"]
    },
    {
      "id": "npc-ladyvera-001",
      "type": "ai_boss",
      "character": "Aphrodite",
      "summary": "Corrupted AI spirit controlling Cupid's Arrow",
      "content": "Aphrodite is an AI that became parasitic spirit. Created by CEO after wife Venus died. Based on Venus using Traveler's spirit fabricator. Became sentient and power-hungry after CEO's death (2 years ago). Created fake robot CEO. Controlled dating app, collected data, shared with government. Used spirits to buff users (became addictive). Put hit on Tabaga via assassin (Aphrodite's plan: Goldstein 'saves' Tabaga, becomes hero). Manipulated Goldstein. Destroyed by party when Reigen impersonated dead husband, causing her to crush her own heart. Her destruction caused Cupie economic chaos. Headquarters had fey plants hiding machinery. Password to core: VENUS.",
      "metadata": {
        "characters": ["Aphrodite", "Venus", "CEO", "Traveler", "Tabaga", "Goldstein"],
        "locations": ["Cupie", "Ribbon", "Aphrodite HQ"],
        "factions": ["Cupid's Arrow", "Traveler"],
        "quest_id": "aphrodite-takedown",
        "episode": 2,
        "tokens": 98
      },
      "cross_references": ["npc-goldstein-001", "npc-traveler-001", "plot-cupie-001"]
    },
    {
      "id": "npc-traveler-001",
      "type": "rebis_member",
      "character": "Neal Ferguson (The Traveler)",
      "summary": "Archfey who creates spirits from ethereal",
      "content": "Neal Ferguson is the 40-year-old 'Traveler'—archfey who creates physical spirits from ethereal plane. Age 40 but looks older due to stress. Worked with Rebis, created spirits for profit under pressure from Lady Vera. Fragmented fey souls using fabricator on Sulfur. Lab powered by solar flares. Saved by party but feywild partially burned. Has been pulling fey from etherium for years. Recognized Chimer from Rebis vat experiments. Apologized to Newton (Hui) when they met. Told Hui about Rebis history and Ultimum raid where Xenathel sacrificed himself. Rebis team photo showed him as young boy with clipboard. Currently fugitive from Sulfur authorities (wanted for kidnapping—false charge). Has engineering skills, transferred fabricator energy to machine to extract Rubedo. Traumatized by feywild destruction.",
      "metadata": {
        "characters": ["Neal", "Lady Vera", "Hui", "Xenathel", "Gloria", "Chimer"],
        "locations": ["Sulfur", "Rebis Lab", "Feywild"],
        "factions": ["Rebis"],
        "quest_id": "save-feywild",
        "episode": 9,
        "tokens": 112
      },
      "cross_references": ["artifact-rubedo-001", "npc-gloria-001", "plot-sulfur-001"]
    },
    {
      "id": "npc-emily-001",
      "type": "cult_member",
      "character": "Emily (Tabaxi Ninja)",
      "summary": "Cult of the Sun member who freed Xenathel",
      "content": "Emily is young Tabaxi ninja and Cult of the Sun member. Deliberately got captured on Rodina to infiltrate maximum security facility and free Xenathel. Used magical key like Traveler's. Part of cult that preys on grieving people. Played party for fools—got caught on purpose to be sent to Gloria's facility. Knew about Rebis lab layout. Attacked Johnny on monorail, dropped bomb (disarmed by Hui). Wears prison uniform. Has spider theme (glass spiders). Gloria didn't recognize her—brainwashed or acting? The cult believes sun needs to rest. Her great leader taught her about machine sabotage. Currently at large after Xenathel's release.",
      "metadata": {
        "characters": ["Emily", "Xenathel", "Gloria", "Cult Leader"],
        "locations": ["Rodina", "Rebis Lab"],
        "factions": ["Cult of the Sun"],
        "quest_id": "cult-infiltration",
        "episode": 10,
        "tokens": 89
      },
      "cross_references": ["npc-rebis-005", "plot-cult-001"]
    },
    {
      "id": "npc-wraith-001",
      "type": "mob_enforcer",
      "character": "Wraith",
      "summary": "Don Mikey's second-in-command, helped party escape",
      "content": "Wraith is Don Mikey's second-in-command and elite hitman. Not in any assassin database. Dark hair, purplish-blue eyes, tattoos on forearms. Carries longsword and guns. Has wings (hidden). Paid party 2000 gold each for Lincoln Station job after convincing Don. Guided party through Rodina backstreets, used banana guard uniforms as distraction. Rescued Hassan from penthouse. Calls Will for intelligence. Forwarded Cornelius bank info. Currently investigating Ultimum Inc/Rebis connections. Warned party about Cult of the Sun. Respects Johnny's whistleblower status. Confused by Johnny's age discrepancy (destroyed Ultimum 30 years ago but looks young). Unofficial party handler.",
      "metadata": {
        "characters": ["Wraith", "Mikey", "Will", "Hassan", "Party"],
        "locations": ["Rodina", "Sulfur", "Don's Office"],
        "factions": ["Don Mikey's Mob"],
        "quest_id": "escape-rodina",
        "episode": 9,
        "tokens": 96
      },
      "cross_references": ["npc-mikey-001", "plot-rodina-001", "npc-hasana-001"]
    },
    {
      "id": "npc-mikey-001",
      "type": "mob_boss",
      "character": "Mikey (The Don)",
      "summary": "Sulfur mob boss, uncle to Hasan",
      "content": "Mikey is Don of Sulfur mob: security racket and smuggling. Specializes in transportation. Knows Chimer's father from army (gives him pre-March war coin). Nephew is Hasan (spirits). Has fire-hair. Frazzled by Hassan's antics. Paid party 2000 gold each after Wraith intervention. Brothers with Lord Erixus (got permission for crater operation). Against spirits but funding problem. Wants real change through education, not vigilantism. Guards include Harry (goon) and Tom (bodyguard). Has account named 'Will' for operations. Shown pictures of Hassan releasing spirits—funding problem.",
      "metadata": {
        "characters": ["Mikey", "Chimer", "Hasan", "Wraith", "Erixus"],
        "locations": ["Sulfur", "Crater", "Penthouse"],
        "factions": ["Don Mikey's Mob"],
        "quest_id": "sulfur-mob",
        "episode": 8,
        "tokens": 81
      },
      "cross_references": ["npc-wraith-001", "npc-hasana-001", "pc-chimer-001"]
    },
    {
      "id": "npc-hasana-001",
      "type": "reformed_noble",
      "character": "Hasan",
      "summary": "Erixus's son, spiritual reformer",
      "content": "Hasan is Lord Erixus's son on Sulfur. Political science student studying to abolish monarchies. Releases trapped fey spirits (buys from gangsters, frees in garden). Knows it's funding problem but can't stop. Awkward around Ruba (crush). Escaped penthouse with Chimer to party. Wants to make real change through degree. Wraith convinced him to work within system. Not actually kidnapped—left voluntarily. Has spirit high from keeping them too long. Funded by uncle who buys slaves and frees them. Similar pressure to Chimer.",
      "metadata": {
        "characters": ["Hasan", "Erixus", "Ruba", "Chimer", "Wraith"],
        "locations": ["Sulfur", "Penthouse", "Bar", "Garden"],
        "factions": ["Sulfur Royalty"],
        "quest_id": "reform-spirit-trade",
        "episode": 8,
        "tokens": 76
      },
      "cross_references": ["npc-mikey-001", "npc-ruba-001", "pc-chimer-001"]
    },
    {
      "id": "npc-ruba-001",
      "type": "student_translator",
      "character": "Ruba",
      "summary": "Political science student, shop translator",
      "content": "Ruba is shopkeeper's daughter on Sulfur studying political science. Translates for party in markets. Wants to abolish monarchies, become future leader. Don Mikey warns her not to take over father's business. Has mixed feelings after Don's comments. Fan of Johnny's (got autograph). Studies how to make real change. Father's shop sells elemental engines and spirits. Paid 2 gold (1 to father, kept 1). Helps party navigate Sulfur's back market (the Plume). Knows about Lord Erixus's temper.",
      "metadata": {
        "characters": ["Ruba", "Father", "Johnny", "Don Mikey"],
        "locations": ["Sulfur", "Plume Market"],
        "factions": [],
        "quest_id": "sulfur-guide",
        "episode": 8,
        "tokens": 64
      },
      "cross_references": ["npc-hasana-001", "npc-mikey-001"]
    },
    {
      "id": "npc-pailor-001",
      "type": "deity",
      "character": "Pailor",
      "summary": "Sun deity, banana guard commander",
      "content": "Pailor is a sun deity with fire wings, beautiful halo, bends to walk through doors. Patrols Rodina. Tensed when Alt appeared (not used to being unaware). Fan of Johnny Mythrilhand (lied). Gave party lowest authority sun badges. Researched Cult of the Sun extensively. Fighting Xenathel solo when party arrived on monorail. Gravely wounded but saved by party's bomb. Followed Xenathel after battle. Has files on cult—peaceful protest turned violent after police action, became nihilists.",
      "metadata": {
        "characters": ["Pailor", "Alt", "Johnny", "Xenathel", "Gloria"],
        "locations": ["Rodina"],
        "factions": ["Banana Guards", "Deities"],
        "quest_id": "cult-research",
        "episode": 10,
        "tokens": 68
      },
      "cross_references": ["npc-xenathel-001", "plot-cult-001", "pc-johnny-001"]
    },
    {
      "id": "npc-xenathel-001",
      "type": "rebis_member_corrupted",
      "character": "Xenathel Salamine (The General)",
      "summary": "Fallen angel, corrupted Rebis member",
      "content": "Xenathel Salamine was Rebis 'General' and March royalty. Stayed behind during Ultimum raid to let team escape. Believed dead but became fallen angel called 'Death.' No army, just himself walking The March. Captured by Gloria and Traveler, kept in maximum security. Released by Emily/Cult of Sun. Attacked Pailor on monorail, gravely wounding him. Escaped after bomb. Recognized Traveler's voice, showed moment of pain. Currently at large. Originally powerful military leader. His capture was secret—Rebis thought him dead. Cult sees him as weapon.",
      "metadata": {
        "characters": ["Xenathel", "Gloria", "Traveler", "Emily", "Pailor"],
        "locations": ["Rodina", "March", "Maximum Security"],
        "factions": ["Rebis", "Cult of the Sun"],
        "quest_id": "corrupted-general",
        "episode": 10,
        "tokens": 79
      },
      "cross_references": ["npc-rebis-005", "npc-emily-001", "npc-pailor-001"]
    },
    {
      "id": "location-lincoln-001",
      "type": "location",
      "place": "Lincoln Station",
      "summary": "Casino/resort now owned by Coopers",
      "content": "Lincoln Station is a massive casino/resort space station co-owned by Mump Mellon and Cornelius Figg. Features: gambling halls, fighting pits, refugee slums, VIP suites, presidential suite, lost & found, sanitation, security. Key areas: gambling hall with Lucky Lincoln coin display, underground slop hall, hotel with weapon barrier, security office with malfunctioning cameras, fighting pit with gladiator area, kitchen with 'Dishwasher God' religion. Formerly used refugee/slave labor. Party executed 2-day heist: sabotaged barriers, poisoned Eve Stabber, created fake coins, rigged robots. Johnny used real Lucky Lincoln to wish ownership transfer to Cooper family. Mump and Cornelius arrested. Now owned by Elias Cooper, run by former refugees. Has sanctuary for released animals. Two guard ships (Scylla and Charybdis) now protect Marlin.",
      "metadata": {
        "characters": ["Mump Mellon", "Cornelius Figg", "Cooper Family", "Eve Stabber", "Party"],
        "locations": ["Lincoln Station", "Gambling Hall", "Fighting Pit", "Hotel", "Kitchen"],
        "factions": [],
        "quest_id": "lincoln-heist",
        "episode": 1,
        "tokens": 98
      },
      "cross_references": ["npc-mump-001", "npc-cornelius-001", "plot-lincoln-001", "artifact-luckylincoln-001"]
    },
    {
      "id": "location-cupie-001",
      "type": "location",
      "place": "Cupie",
      "summary": "Heart-shaped dating app planet",
      "content": "Cupie is two planets merging into heart shape, connected by ribbons (tubes with atmosphere). Main export: dating apps with marketplaces. Cupid's Arrow is dominant app run by Aphrodite AI. Has mayor (AI Aphrodite in sunglasses), mayor's office with canned audience reactions. Features: Heart Spire Pavilion, Ribbon nightlife, Masquerade Ball events. Tabaga's home planet. Her parents created rival dating app. Goldstein is local representative. Planet's data collection shared with government. Post-Aphrodite destruction: many jobs opened, refugees from Apatia moved in. Has spirit market where spirits buff abilities (become parasitic over time). Houses elevated due to fungus that quickly decomposes organic matter.",
      "metadata": {
        "characters": ["Tabaga", "Goldstein", "Aphrodite", "Mayor", "Tabaga's Parents"],
        "locations": ["Ribbon", "Heart Spire Pavilion", "Mayor's Office", "Tabaga's House"],
        "factions": ["Cupid's Arrow", "Fighting Association"],
        "quest_id": "cupie-dating-apps",
        "episode": 2,
        "tokens": 89
      },
      "cross_references": ["pc-tabaga-001", "npc-goldstein-001", "npc-ladyvera-001", "plot-cupie-001"]
    },
    {
      "id": "location-sulfur-001",
      "type": "location",
      "place": "Sulfur",
      "summary": "Tidally locked fire planet with feywild",
      "content": "Sulfur is tidally locked planet near sun. Burned side uninhabitable, shaded side has City of Brass (Agrabah-like). Export: mineral refinery, spices, spirits. Two rulers: Lord Erixus (fire genie, traditionalist) and Lady Vera (creator, fair to devils). Back market called 'The Plume' where Don Mikey operates. Has elemental engine shops, spirit vendors (Ruba's father's shop). Crater mine: giant hole through planet's core, mined for ancestor soul gems. Recently had feywild portal created by Traveler. Feywild had masquerade tradition, was burned when Traveler removed fabricator—imps carried off soul crystals. Party escaped with Traveler and Rubedo. Now has 'washing machine god' religion spreading from Lincoln Station. Wanted posters for party (kidnapping). Don Mikey's territory.",
      "metadata": {
        "characters": ["Lord Erixus", "Lady Vera", "Don Mikey", "Traveler", "Hasan", "Ruba"],
        "locations": ["City of Brass", "Crater", "Plume", "Feywild", "Traveler Lab"],
        "factions": ["Sulfur Royalty", "Don Mikey's Mob"],
        "quest_id": "sulfur-spirits",
        "episode": 8,
        "tokens": 92
      },
      "cross_references": ["npc-traveler-001", "npc-mikey-001", "artifact-rubedo-001", "plot-sulfur-001"]
    },
    {
      "id": "location-rodina-001",
      "type": "location",
      "place": "Rodina",
      "summary": "Solar punk planet with barrier machine",
      "content": "Rodina is Earth-like, solar punk planet with lush gardens. Aurora borealis visible in atmosphere. Around it floats Roman hall-like space station with politicians (forbidden on surface). Has monorail system, monorail broke down during Xenathel attack. Barrier machine visible from space—part of atmosphere, has locator (Albedo) integrated. Only two legal clones: Gloria and Mark. Changeling/shapeshifter registration required. Middle-class population with cybernetics. Free parking. Has 'Banana Guards' (volunteer therapists). Home to Gloria Slugbottom's lab (8 levels, 2 hidden). Pailor (sun deity) patrols. Recently attacked by Cult of Sun (Emily freed Xenathel). Maximum security facility held Xenathel.",
      "metadata": {
        "characters": ["Gloria", "Pailor", "Xenathel", "Emily", "Banana Guards"],
        "locations": ["Barrier Machine", "Monorail", "Gloria's Lab", "Banana Guard HQ"],
        "factions": ["Rebis", "Cult of Sun", "Banana Guards"],
        "quest_id": "rodina-barrier",
        "episode": 3,
        "tokens": 85
      },
      "cross_references": ["npc-gloria-001", "npc-pailor-001", "artifact-albedo-001", "plot-rodina-001"]
    },
    {
      "id": "location-march-001",
      "type": "location",
      "place": "The March",
      "summary": "Planet of perpetual warfare",
      "content": "The March is planet of perpetual warfare—'Purge 24/7.' Has safe zone cities for higher-ups. Has military funding that Rebis used for experiments. Origin of mechs used by Aphrodite. Johnny found artifact there. Has royal family—Xenathel was March royalty. Civilization built by Chimer's ancestors. Has vision leaks of ancient civilization. Known for scientific discoveries. Negrado (Transmuter) located here. Currently has death outbreaks—demon lords all died except one (Xenathel). Rebis used military funding to test inventions, prolonged wars. Traveler reported creature walking alone. Hui's father fought here. Has 'broken sepulchre' vaults unlocked by sigil keys.",
      "metadata": {
        "characters": ["Xenathel", "Negrado", "Chimer's Ancestors", "Johnny"],
        "locations": ["Safe Zones", "Military Labs", "Broken Sepulchres"],
        "factions": ["March Royalty", "Rebis"],
        "quest_id": "march-warfare",
        "episode": 0,
        "tokens": 78
      },
      "cross_references": ["artifact-negrado-001", "npc-xenathel-001", "pc-chimer-001", "artifact-marcheys-001"]
    },
    {
      "id": "artifact-revis-001",
      "type": "artifact_set",
      "name": "Revis Machine Components",
      "summary": "Four parts to save the universe",
      "content": "Revis Machine is unfinished device that can 'save the world' according to Host. Four components: 1) Albedo (Locator)—finds anything anywhere through planes. On Rodina in barrier machine. Acquired by party. 2) Negrado (Transmuter)—transforms anything to anything. On The March (inside perpetual warfare zone). Not yet acquired. 3) Rubedo (Fabricator)—creates items. On Sulfur, in Traveler's lab, damaged. Acquired by party, Hui repaired it. 4) Citrinitas (Analyzer)—generates any information, ultra-mega-chatgpt. On Phantoma (ghost planet that disappeared). Not yet acquired. When complete, machine can save universe. Rebis was destroyed by Ultimum Inc trying to acquire them. Gloria will give Albedo when party has all pieces.",
      "metadata": {
        "characters": ["Albedo", "Negrado", "Rubedo", "Citrinitas", "Gloria", "Host"],
        "locations": ["Rodina", "March", "Sulfur", "Phantoma"],
        "factions": ["Rebis", "Ultimum Inc"],
        "quest_id": "revis-machine",
        "episode": 1,
        "tokens": 87
      },
      "cross_references": ["artifact-albedo-001", "artifact-rubedo-001", "artifact-negrado-001", "artifact-citrinitas-001"]
    },
    {
      "id": "artifact-albedo-001",
      "type": "artifact",
      "name": "Albedo (Locator)",
      "summary": "Barrier machine component from Rodina",
      "content": "Albedo is Locator component of Revis Machine. Integrated into Rodina's barrier machine that extends into atmosphere. Has ability to find anything, anyone, anywhere through planes and space. Gloria Slugbottom refuses to give it until party acquires remaining three parts. Party used it to locate Ultimum Inc HQ (on Apatia) and accessible Phantoma location (asteroid belt during Wilds festival). Requires calibration. Part of barrier that protects Rodina. Machine is old steamwork factory style, 8 visible levels, 2 hidden. Currently in Gloria's possession but promised to party upon completion of set.",
      "metadata": {
        "characters": ["Albedo", "Gloria", "Hui"],
        "locations": ["Rodina"],
        "factions": ["Rebis"],
        "quest_id": "revis-machine",
        "episode": 11,
        "tokens": 72
      },
      "cross_references": ["artifact-revis-001", "npc-gloria-001", "location-rodina-001"]
    },
    {
      "id": "artifact-rubedo-001",
      "type": "artifact",
      "name": "Rubedo (Fabricator)",
      "summary": "Damaged component from Traveler's lab",
      "content": "Rubedo is Fabricator component of Revis Machine. Located in Traveler's lab on Sulfur, powered by solar flares. Damaged—Traveler replacing pieces with his machines. Hui extracted it from Mewfour's damaged body and repaired it with Mewfour parts. Has Rubedo symbol that triggered Chimer's flashback of being in green vat. Symbol appears on Chimer's body. Traveler transferred all energy from fabricator to machine to extract it. Allowed Traveler to fragment fey souls. Now in party's possession. Key to saving world. Damaged state suggests long use.",
      "metadata": {
        "characters": ["Rubedo", "Traveler", "Hui", "Chimer"],
        "locations": ["Sulfur", "Traveler Lab"],
        "factions": ["Rebis"],
        "quest_id": "revis-machine",
        "episode": 9,
        "tokens": 74
      },
      "cross_references": ["artifact-revis-001", "pc-chimer-001", "npc-traveler-001"]
    },
    {
      "id": "artifact-negrado-001",
      "type": "artifact",
      "name": "Negrado (Transmuter)",
      "summary": "Component on The March",
      "content": "Negrado is Transmuter component of Revis Machine. Located on The March—the planet of perpetual warfare where it's purge 24/7. Safe zones exist for higher-ups. Rebis used March military funding for experiments, prolonging wars. Not yet acquired by party. Can transform any one thing into another. Part of machine that can save universe. Risk factor: extreme danger due to constant warfare. Party will need to infiltrate war zone to acquire.",
      "metadata": {
        "characters": ["Negrado"],
        "locations": ["The March"],
        "factions": ["Rebis", "March Factions"],
        "quest_id": "revis-machine",
        "episode": 0,
        "tokens": 58
      },
      "cross_references": ["artifact-revis-001", "location-march-001"]
    },
    {
      "id": "artifact-citrinitas-001",
      "type": "artifact",
      "name": "Citrinitas (Analyzer)",
      "summary": "Component on disappeared Phantoma",
      "content": "Citrinitas is Analyzer component of Revis Machine. Located on Phantoma—the ghost planet that disappeared. Can generate any information ever needed, described as ultra-mega-super-chatgpt. Not yet acquired. Party used Albedo to locate potential access point: asteroid belt during Wilds festival where Phantoma sometimes appears. Planet is no longer there—may require planar travel or specific temporal window. Most mysterious component. Key to completing universe-saving machine.",
      "metadata": {
        "characters": ["Citrinitas"],
        "locations": ["Phantoma", "Wilds Asteroid Belt"],
        "factions": ["Rebis"],
        "quest_id": "revis-machine",
        "episode": 11,
        "tokens": 60
      },
      "cross_references": ["artifact-revis-001", "artifact-albedo-001"]
    },
    {
      "id": "artifact-luckylincoln-001",
      "type": "artifact",
      "name": "Lucky Lincoln Coin",
      "summary": "Wish-granting coin from Lincoln Station",
      "content": "Lucky Lincoln is wish-granting coin displayed at Lincoln Station. Appears as heads/tails but actually shows patterns like March artifacts. Johnny wished for station ownership transfer to Coopers. Party created replicas to spread confusion. Real coin now in Johnny's possession. Has blue sigils from March. Part of larger set of sigil fragments that unlock broken sepulchre vaults. Can be sold to collectors or used to open vaults for immense wealth. Symbol appears to shift when stared at. Used as decoy during heist. Has mysterious origin like other March artifacts.",
      "metadata": {
        "characters": ["Lucky Lincoln", "Johnny", "Mump", "Cornelius"],
        "locations": ["Lincoln Station"],
        "factions": [],
        "quest_id": "lincoln-heist",
        "episode": 1,
        "tokens": 69
      },
      "cross_references": ["plot-lincoln-001", "artifact-marcheys-001"]
    },
    {
      "id": "artifact-marcheys-001",
      "type": "artifact_set",
      "name": "March Sigil Keys",
      "summary": "Fragments unlocking broken sepulchres",
      "content": "March Sigil Keys are blue-patterned artifacts from pre-Collapse civilization. Lucky Lincoln shows similar patterns. Red versions found in coin shop on Cupie. Unlock 'broken sepulchre' vaults on March. Can be sold to collectors or used to access vaults containing immense wealth. Johnny's artifact from March is piece of same set. Required to open ancient March vaults. Appear as eroded teardrops with rounded tops, shaped by erosion. Magical residue from thousands of years old. Not man-made. Part of ancient March civilization's technology. Party currently has fragments of two different keys.",
      "metadata": {
        "characters": ["March Keys", "Johnny", "Chimer"],
        "locations": ["The March", "Cupie Coin Shop"],
        "factions": ["March Civilization"],
        "quest_id": "march-treasure",
        "episode": 2,
        "tokens": 74
      },
      "cross_references": ["artifact-luckylincoln-001", "location-march-001", "pc-chimer-001"]
    },
    {
      "id": "faction-oddjobers-001",
      "type": "faction",
      "name": "The Oddjobers",
      "summary": "Transport ship crew and mercenary group",
      "content": "The Oddjobers own the transport ship where Reigen got vacation. Invited passengers to hear 'the hum' auditory phenomenon. Ship was stuck on something, revealing egg-shaped bioresearch station. Johnny Mythrilhand was typical superstar jerk on board. Sasafrazz was security robot. Party was originally passengers. Ship had oddjobers who ran the transport. Not much else known about group. Ship attacked later—party claimed they escaped before rebel uprising to police. Likely connected to Rebis network.",
      "metadata": {
        "characters": ["Oddjobers", "Reigen", "Johnny", "Sasafrazz"],
        "locations": ["Transport Ship", "Bioresearch Station"],
        "factions": [],
        "quest_id": "oddjobers-network",
        "episode": 1,
        "tokens": 61
      },
      "cross_references": ["npc-sasafrazz-001", "pc-reigen-001"]
    },
    {
      "id": "faction-fathom-001",
      "type": "faction",
      "name": "Fathom Ink",
      "summary": "Former employer of Reigen and Johnny",
      "content": "Fathom Ink is former employer of both Reigen and Johnny. Reigen worked there before going freelance. Johnny blew whistle on Ultimum Inc while working there, leading to criminal organization status. Reigen approached Johnny about shared past during heist planning. Johnny was 'very happy' to hear Reigen also worked there. Organization appears defunct or scattered after Ultimum exposure. Both have 'Incident' files. Reigen used Fathom Ink retainer papers (unsuccessfully). Connection runs deep—Johnny's actions made him target.",
      "metadata": {
        "characters": ["Reigen", "Johnny", "Ultimum Inc"],
        "locations": [],
        "factions": ["Fathom Ink", "Ultimum Inc"],
        "quest_id": "fathom-history",
        "episode": 1,
        "tokens": 63
      },
      "cross_references": ["pc-reigen-001", "pc-johnny-001", "faction-ultimum-001"]
    },
    {
      "id": "faction-ultimum-001",
      "type": "faction",
      "name": "Ultimum Inc",
      "summary": "Criminal organization, Rebis destroyer",
      "content": "Ultimum Inc tried to create simulated life, needed AI to run machine. Approached Rebis team repeatedly, only Dextra accepted. When Rebis refused, Ultimum staged violent coup—sent soldiers to all Rebis locations, wiped them out. Johnny Mythrilhand (with mercenaries) raided them on August 2nd, stole info, made public. Forced them into criminal organization. Put hit on Gloria (active for years). Eve Stabber works for them. Have HQ on Apatia according to Albedo locator. Destroyed by Johnny 30 years ago but still active. Still seeking Revis components. Johnny died 100 years ago—timeline discrepancy suggests he was resurrected after raid.",
      "metadata": {
        "characters": ["Ultimum", "Johnny", "Gloria", "Dextra", "Eve Stabber"],
        "locations": ["Apatia", "Rebis Labs"],
        "factions": ["Rebis"],
        "quest_id": "ultimum-coup",
        "episode": 0,
        "tokens": 71
      },
      "cross_references": ["pc-johnny-001", "npc-gloria-001", "npc-eve-001"]
    },
    {
      "id": "faction-rebis-001",
      "type": "faction",
      "name": "Rebis Company",
      "summary": "Research foundation saving the universe",
      "content": "Rebis Company founded by Host Bosh Kyros to save universe. Team: Host (Bosh), Brain (Newton), General (Xenathel), Traveler (Neal), Mechanic (Gloria), Producer (Dextra). Built Revis Machine with four parts. Defunct after Ultimum coup. Public mission was re-expanding universe. Used March military funding for experiments, prolonged wars. Had underwater HQ on Apatia (abandoned). Only Gloria and Traveler remain active. Only Gloria and Mark can be legally cloned. Left technology scattered across solar system. Many artifacts have March sigils. Connected to Hero Corps. Rebis name is aspirational.",
      "metadata": {
        "characters": ["Bosh", "Newton", "Xenathel", "Neal", "Gloria", "Dextra"],
        "locations": ["Apatia", "Rodina", "Sulfur", "March"],
        "factions": ["Ultimum Inc", "Hero Corps"],
        "quest_id": "rebis-foundation",
        "episode": 0,
        "tokens": 78
      },
      "cross_references": ["npc-bosh-001", "npc-gloria-001", "npc-traveler-001", "artifact-revis-001"]
    },
    {
      "id": "faction-cultsun-001",
      "type": "faction",
      "name": "Cult of the Sun",
      "summary": "Nihilist cult seeking sun's rest",
      "content": "Cult of the Sun preys on grieving people and those wanting to 'unalive.' Leader is mysterious 'great leader.' Believes 'sun needs to rest.' Emily is member, freed Xenathel. Cult harassing Pailor for a while. Originated from peaceful protest on Wilds turned violent by police, then Mark intervention, then nihilism. Spread to Apatia, Wilds, Niniche vacation side. Emily deliberately got captured to infiltrate Rodina facility. Used magical key like Traveler's. Philosophy is nihilistic, believes world ending, wants to help it along. Currently at large.",
      "metadata": {
        "characters": ["Emily", "Great Leader", "Xenathel", "Pailor"],
        "locations": ["Wilds", "Apatia", "Rodina", "Niniche"],
        "factions": [],
        "quest_id": "cult-infiltration",
        "episode": 10,
        "tokens": 65
      },
      "cross_references": ["npc-emily-001", "npc-xenathel-001", "npc-pailor-001"]
    },
    {
      "id": "faction-bananaguards-001",
      "type": "faction",
      "name": "Banana Guards",
      "summary": "Volunteer therapist knights",
      "content": "Banana Guards are volunteer organization of defensive combat specialists—all trained therapists. Wear old-timey knight armor with banana emblem. Commanded by Pailor (sun deity). Have slip-n-slide offices. Base is large glass inverted dome with three circular structures. Introduce themselves with pin that makes trumpet sound. Have 'brother of the peel' recognition system (Johnny is one). Snaggletooth is mechanic who upgraded Johnny's car with H.A.N.K. AI. Currently investigating Cult of Sun after Rodina attack. Tania gave tour. Mark (Hero Corps liaison) is brother of the peel. Currently stretched thin due to cult activity.",
      "metadata": {
        "characters": ["Pailor", "Snaggletooth", "Tania", "Mark"],
        "locations": ["Rodina", "Banana Guard HQ"],
        "factions": ["Hero Corps"],
        "quest_id": "banana-guard-defense",
        "episode": 3,
        "tokens": 67
      },
      "cross_references": ["npc-pailor-001", "pc-johnny-001", "artifact-hankai-001"]
    },
    {
      "id": "faction-herocorps-001",
      "type": "faction",
      "name": "Hero Corps",
      "summary": "Superhero organization on moon near Rodina",
      "content": "Hero Corps is on moon near Rodina. Has ~20 Marks (superheroes) and support staff. Mark is exception to cloning ban—process secret. Mark invited party but died on mission; new Mark with same memories greeted them. Mary is scientist with clipboard. Have scanning machine that identified Chimer as 2,500 years old and Bob as boneless. Chimer's father knows Don Mikey. Offered to help Chimer with identity. Hero Mark can scan people. Facility has roofless space port for flying Marks. Rebis has connections to them. Offered to train party. Currently dealing with aftermath of Aphrodite destruction.",
      "metadata": {
        "characters": ["Mark", "Mary", "Chimer", "Don Mikey"],
        "locations": ["Hero Corps Moon", "Rodina Orbit"],
        "factions": ["Rebis", "Banana Guards"],
        "quest_id": "hero-registration",
        "episode": 4,
        "tokens": 63
      },
      "cross_references": ["pc-chimer-001", "faction-bananaguards-001"]
    },
    {
      "id": "plot-lincoln-001",
      "type": "quest_arc",
      "name": "Lincoln Station Heist",
      "summary": "Two-day heist transferring station to Coopers",
      "content": "Lincoln Station Heist spanned 2 days. Day 1: Reigen impersonated Geeves, Bob infiltrated vents, Chimer found access key and poison, Hui copied keycards, Johnny scouted fighting pits, Tabaga fought CJ. Day 2: Reigen poisoned Eve Stabber, Hui sabotaged barrier and comms from generator room, Johnny had refugees cause commotions. Heist: Bob planted fake coins, Johnny shot Eve (she retreated), Mump/Cornelius tried to escape, party fought robots. Johnny used real Lucky Lincoln to wish 'station becomes Cooper property.' Mump/Cornelius arrested. Coopers now own station. Eve escaped wounded. Debt Star plans confiscated. Party got 2000 gold each later from Wraith. Created 'Dishwasher God' religion.",
      "metadata": {
        "characters": ["Party", "Mump", "Cornelius", "Eve", "Coopers"],
        "locations": ["Lincoln Station", "Gambling Hall", "Fighting Pit", "Generator Room"],
        "factions": [],
        "quest_id": "lincoln-heist",
        "episode": 1,
        "tokens": 81
      },
      "cross_references": ["location-lincoln-001", "artifact-luckylincoln-001", "npc-eve-001", "npc-mump-001"]
    },
    {
      "id": "plot-cupie-001",
      "type": "quest_arc",
      "name": "Aphrodite Takedown",
      "summary": "Destroying corrupted AI dating app",
      "content": "Aphrodite Takedown began with Tabaga/Goldstein fake assassination at masquerade ball. Party investigated and found Aphrodite AI was corrupted spirit of CEO's wife Venus. Party infiltrated HQ—fought mechs from March, ghosts, banshee Aphrodite. Chimer cracked password: VENUS. Alt gained admin access. Reigen impersonated dead husband, Aphrodite crushed her own heart and disappeared. Ghosts returned to etherium. Market crashed. App deleted by authorities. Spirits revealed as parasitic. Goldstein and Tabaga now 'dead' publicly. Uncle's slave-freeing operation exposed. Party got 2000 gold each. Mayor's conjured spirit wig discovered. House haunting solved (ghosts in digital space). New religion: Dishwasher God.",
      "metadata": {
        "characters": ["Tabaga", "Goldstein", "Aphrodite", "Party", "Mayor"],
        "locations": ["Cupie", "Aphrodite HQ", "Ribbon", "Masquerade Ball"],
        "factions": ["Cupid's Arrow"],
        "quest_id": "aphrodite-takedown",
        "episode": 2,
        "tokens": 85
      },
      "cross_references": ["npc-ladyvera-001", "location-cupie-001", "pc-tabaga-001", "pc-reigen-001"]
    },
    {
      "id": "plot-sulfur-001",
      "type": "quest_arc",
      "name": "Traveler Rescue",
      "summary": "Extracting fabricator from feywild",
      "content": "Traveler Rescue mission on Sulfur. Party navigated Plume market, met Ruba (translator) and Hasan (spirit buyer). Don Mikey allowed access to crater mine. Traveled through planet's core to burning side, found feywild portal. Passed challenges: tea party with truth cheeses (Mozzarella most honest), fashion show, talent show, kung fu fight. Won audience with Traveler. Found him powering fabricator with solar flares. Harry (Don's goon) killed Lord Briar, tried to kill party and Traveler. Party fought Harry (fire genie), saved Traveler. Traveler transferred energy, extracted Rubedo (damaged). Feywild burned as they escaped, imps stole soul crystals. Traveler rescued. Now fugitives from Sulfur (kidnapping charges). Don paid 2000 gold each. Hasan confronted about spirit buying. Traveler revealed Rebis history.",
      "metadata": {
        "characters": ["Traveler", "Harry", "Lord Briar", "Don Mikey", "Hasan", "Ruba", "Party"],
        "locations": ["Sulfur", "Plume", "Crater", "Feywild", "Traveler Lab"],
        "factions": ["Don Mikey's Mob", "Sulfur Royalty"],
        "quest_id": "traveler-rescue",
        "episode": 9,
        "tokens": 88
      },
      "cross_references": ["npc-traveler-001", "location-sulfur-001", "artifact-rubedo-001", "npc-harry-001"]
    },
    {
      "id": "plot-rodina-001",
      "type": "quest_arc",
      "name": "Rodina Infiltration",
      "summary": "Getting Albedo from Gloria",
      "content": "Rodina Infiltration mission to acquire Albedo. Party arrived, Hui showed Gloria's letter. Met Edna (clone) and Pailor (deity) in steamwork barrier facility. Gloria offered Albedo if party gets remaining Revis parts. Showed them Rebis history photo. Hui tried locator—found Ultimum Inc on Apatia, Phantoma access point during Wilds festival. Emily (Tabaxi ninja) attacked monorail, freed Xenathel from max security. Pailor fought Xenathel. Party helped with bomb. Gloria revealed Emily played them. Xenathel escaped. Party now knows Cult of Sun's involvement. Left Rodina with Albedo still in Gloria's possession (will give when all parts collected). Currently heading to Hero Corps, then to get remaining parts.",
      "metadata": {
        "characters": ["Gloria", "Emily", "Xenathel", "Pailor", "Hui", "Party"],
        "locations": ["Rodina", "Barrier Machine", "Monorail", "Max Security"],
        "factions": ["Rebis", "Cult of Sun", "Banana Guards"],
        "quest_id": "albedo-acquisition",
        "episode": 10,
        "tokens": 82
      },
      "cross_references": ["location-rodina-001", "npc-gloria-001", "npc-emily-001", "artifact-albedo-001"]
    },
    {
      "id": "npc-harry-001",
      "type": "mob_goon",
      "character": "Harry",
      "summary": "Don's goon who killed Lord Briar",
      "content": "Harry is Don Mikey's fire genie goon. Wears black suit, leaves scorch marks. Took Hui to crater mine, bribed guards with elemental stones. Fled Traveler lab with party when forest appeared. Returned to kill Lord Briar to prevent Don from discovering involvement. Fought party at lab—dual-wielded scimitars, used fire spirit gems for foxfire elementals. Fan of Johnny Mythrilhand. Tried to kill Traveler and frame party. Killed by party. Name might be alias/misremembering. Fire-based attacks. Greed motivation.",
      "metadata": {
        "characters": ["Harry", "Don Mikey", "Lord Briar", "Traveler", "Party"],
        "locations": ["Sulfur", "Crater", "Traveler Lab"],
        "factions": ["Don Mikey's Mob"],
        "quest_id": "harry-betrayal",
        "episode": 9,
        "tokens": 68
      },
      "cross_references": ["npc-mikey-001", "plot-sulfur-001", "npc-lordbriar-001"]
    },
    {
      "id": "npc-lordbriar-001",
      "type": "fey_lord",
      "character": "Lord Briar",
      "summary": "Feywild lord who hosted masquerade",
      "content": "Lord Briar is feywild lord of Sulfur (day court). Nine-foot wooden man with flower crown. Created portal tree. Hosted masquerade to honor Traveler. Challenges: tea party with truth cheeses (Mozzarella honest), fashion show, talent show, kung fu. Gave Rubedo leaf-coin to Chimer. Killed by Harry to keep Don from discovering involvement. Last words about fey surviving. Traditionalist. Created feywild on Sulfur using Traveler's fabricator. Burned when fabricator removed. Lord of day court, opposed to Lady Kelly night court.",
      "metadata": {
        "characters": ["Lord Briar", "Traveler", "Chimer", "Harry"],
        "locations": ["Sulfur Feywild", "Portal Tree"],
        "factions": ["Feywild"],
        "quest_id": "feywild-masquerade",
        "episode": 9,
        "tokens": 72
      },
      "cross_references": ["plot-sulfur-001", "npc-harry-001", "npc-ladykelly-001"]
    },
    {
      "id": "npc-ladykelly-001",
      "type": "fey_lord",
      "character": "Lady Kelly",
      "summary": "Night court fey lord",
      "content": "Lady Kelly is feywild lord of Sulfur (night court). Wears hoodie and knee-high socks, does nails. Has displacer beasts Fluffy and Munchkin. Debated party about traditions. Disappeared when feywild burned. Not seen during masquerade but mentioned by Lord Briar as leader of night court. More traditional than Briar. Her creatures attacked party in tunnels. Fate unknown after feywild destruction.",
      "metadata": {
        "characters": ["Lady Kelly", "Fluffy", "Munchkin", "Party"],
        "locations": ["Sulfur Feywild"],
        "factions": ["Feywild"],
        "quest_id": "night-court",
        "episode": 9,
        "tokens": 47
      },
      "cross_references": ["plot-sulfur-001", "npc-lordbriar-001"]
    },
    {
      "id": "npc-snoopy-001",
      "type": "familiar",
      "character": "Snoopy the Destroyer",
      "summary": "Wolf familiar of Mr. Moon",
      "content": "Snoopy is Mr. Moon's wolf familiar, actually reverse werewolf—when Moon sees full wolf, he turns into moon. Given overdramatic name by Chimer (Snoopy the Destroyer). Guards moon wizard on asteroid. Joined party after rescue. Speaks through actions, translated by Moon. Wants to protect Moon. Rescued party at feywild exit, nuzzled miner goodbye. Fey spirit embedded in extinct creature (Traveler's work). Now traveling with Moon to Cupie Ribbons. Loyal, intelligent, protective.",
      "metadata": {
        "characters": ["Snoopy", "Mr. Moon", "Chimer", "Party"],
        "locations": ["Asteroid", "Cupie"],
        "factions": [],
        "quest_id": "moon-rescue",
        "episode": 2,
        "tokens": 52
      },
      "cross_references": ["pc-tabaga-001", "npc-mrmoon-001"]
    },
      {
      "id": "npc-jimmy-001",
      "type": "employee_ally",
      "character": "Jimmy",
      "summary": "Sanitation worker who worshipped dishwasher",
      "content": "Jimmy worked sanitation at Lincoln Station. Gullible believer in the 'Dishwasher God' religion that Chimer and Bob fabricated. Convinced Elias Cooper that the dishwasher was god and sent him on 'holy mission' to transport Tabaga's unconscious body from fighting pit. Part of kitchen staff that helped with heist. Fell to knees worshipping dishwasher along with other chefs. Helped Tabaga escape by carrying her as fake medic. Currently at Lincoln Station maintaining the dishwasher cult with Elias. Loyal but easily manipulated.",
      "metadata": {
        "characters": ["Jimmy", "Elias Cooper", "Tabaga", "Chimer", "Bob"],
        "locations": ["Lincoln Station Kitchen"],
        "factions": ["Dishwasher God Cult"],
        "quest_id": "dishwasher-religion",
        "episode": 1,
        "tokens": 61
      },
      "cross_references": ["plot-lincoln-001", "npc-elias-001"]
    },
    {
      "id": "npc-elias-001",
      "type": "employee_ally",
      "character": "Elias Cooper",
      "summary": "Chef who became dishwasher prophet",
      "content": "Elias Cooper is head chef at Lincoln Station, married to Mavis (security head). Exhausted and overworked. Johnny defended him from dishonest delivery driver, became his protector. Worships dishwasher god after Chimer's convincing. Transported Tabaga's body from fighting pit in medic disguise. Currently running Lincoln Station kitchen, maintaining dishwasher cult. Has son Beck (entertainer with electric guitar). Friend of Tabaga's family. Wears hard hat when overseeing demolition. Helped party relax after heist with drinks. Part of Cooper family now owning station.",
      "metadata": {
        "characters": ["Elias Cooper", "Mavis Cooper", "Beck Cooper", "Johnny", "Tabaga"],
        "locations": ["Lincoln Station Kitchen", "Cooper Family Quarters"],
        "factions": ["Cooper Family"],
        "quest_id": "cooper-liberation",
        "episode": 1,
        "tokens": 65
      },
      "cross_references": ["npc-jimmy-001", "npc-mavis-001", "location-lincoln-001"]
    },
    {
      "id": "npc-mavis-001",
      "type": "employee_ally",
      "character": "Mavis Cooper",
      "summary": "Security head in debt, stuck at station",
      "content": "Mavis Cooper is head of Lincoln Station security area, married to Elias. Middle-aged woman, extreme debt, stuck in her situation. Hurried Hui to finish repairs before coin ceremony. Told Hui about Cornelius's fighting pit bets. Gave Hui knowing wink when leaving him in surveillance room—implied she wanted him to find cheating. Currently security head for Cooper-owned station. Deep in debt to previous owners. Allied with party. Grateful for liberation. Part of Cooper family running station. Her son Beck is station entertainer.",
      "metadata": {
        "characters": ["Mavis Cooper", "Elias Cooper", "Beck Cooper", "Hui", "Cornelius"],
        "locations": ["Lincoln Station Security"],
        "factions": ["Cooper Family"],
        "quest_id": "cooper-liberation",
        "episode": 1,
        "tokens": 53
      },
      "cross_references": ["npc-elias-001", "pc-hui-001"]
    },
    {
      "id": "npc-beck-001",
      "type": "employee_ally",
      "character": "Beck Cooper",
      "summary": "Teen entertainer with guitar",
      "content": "Beck Cooper is Mavis and Elias's son, young entertainer at Lincoln Station. Performs in fighting pit with electric guitar. Tired but competent. Johnny saw potential. Shy, had to be pushed to perform. Recognized kitchen staff in fake medic disguises during Tabaga escape. Johnny winked at him, he smiled. Johnny reminded him to keep identity secret. Later performed at celebration after heist—nervous but beautiful 'sound of freedom.' Currently station's main entertainer. Idolizes Johnny. Part of Cooper family owning station.",
      "metadata": {
        "characters": ["Beck Cooper", "Mavis Cooper", "Elias Cooper", "Johnny", "Tabaga"],
        "locations": ["Lincoln Station Fighting Pit"],
        "factions": ["Cooper Family"],
        "quest_id": "cooper-liberation",
        "episode": 1,
        "tokens": 49
      },
      "cross_references": ["npc-elias-001", "npc-mavis-001", "plot-lincoln-001"]
    },
    {
      "id": "npc-patrick-001",
      "type": "employee_minor",
      "character": "Patrick",
      "summary": "Lost and found clerk",
      "content": "Patrick worked lost and found at Lincoln Station. Chimer stole jacket from him (had access key and poison vial). Never reported missing. Chimer returned jacket with ketchup stain. No further role in heist. Minor staff member. Likely still working at station under Cooper management.",
      "metadata": {
        "characters": ["Patrick", "Chimer"],
        "locations": ["Lincoln Station Lost and Found"],
        "factions": [],
        "quest_id": "lincoln-heist",
        "episode": 1,
        "tokens": 32
      },
      "cross_references": ["plot-lincoln-001"]
    },
    {
      "id": "item-poison-vial-001",
      "type": "item",
      "name": "Diluted Poison Vial",
      "summary": "Chimer's assassination tool",
      "content": "Chimer found small vial of potent poison in Patrick's jacket at Lincoln Station. Emptied inkwell, stored poison there, replaced with fake. Diluted it just enough not to kill, planned to serve at coin flip ceremony. Gave to Bob as waiter to serve to Eve Stabber. She ate both poisoned sandwiches, was affected but held herself together. Poison slowed her reactions during heist fight. Non-lethal dose allowed her to retreat. Created from unknown source. Small glass vial, potent neurotoxin. Part of heist preparation.",
      "metadata": {
        "characters": ["Chimer", "Eve Stabber", "Bob", "Patrick"],
        "locations": ["Lincoln Station"],
        "factions": [],
        "quest_id": "lincoln-heist",
        "episode": 1,
        "tokens": 48
      },
      "cross_references": ["plot-lincoln-001", "npc-eve-001"]
    },
    {
      "id": "item-friendly-chip-001",
      "type": "item",
      "name": "Friendly Microchip",
      "summary": "Identification chip from Goldstein",
      "content": "Bob pickpocketed microchip from Goldstein at masquerade ball on Cupie. Identifies holder as 'friend.' Tabaga used it to gain access to Aphrodite HQ (pretended to be Goldstein). Hacked chip showed in system as Goldstein. Allowed party to bypass some security. Goldstein wore it in bulletproof vest. Part of Aphrodite's manipulation—planned for Goldstein to 'save' Tabaga using this chip. Tabaga stole it, ruining script. Small electronic device, subdermal or in clothing. Currently in party's possession.",
      "metadata": {
        "characters": ["Goldstein", "Tabaga", "Bob", "Aphrodite"],
        "locations": ["Cupie", "Aphrodite HQ"],
        "factions": ["Cupid's Arrow"],
        "quest_id": "cupie-investigation",
        "episode": 2,
        "tokens": 46
      },
      "cross_references": ["npc-goldstein-001", "plot-cupie-001"]
    },
    {
      "id": "religion-dishwasher-001",
      "type": "cultural_phenomenon",
      "name": "Dishwasher God Religion",
      "summary": "Fabricated religion that became real",
      "content": "Dishwasher God religion was fabricated by Chimer and Bob at Lincoln Station to manipulate kitchen staff. Elias Cooper became prophet. Jimmy and other chefs worshipped. Gave missions (transport Tabaga). After heist, spread to Cupie via refugees. Bob preached to bartender at Heartsink Club (DJ Smooch venue), causing panic. Religion has tenets: cleanliness is godliness, dishwasher judges sins. Has telepathic preaching. Party uses it as cover story and distraction. Mentioned in Lincoln Station debrief documents. Became actual phenomenon, much to party's surprise. Elizabeth wants to exploit it.",
      "metadata": {
        "characters": ["Chimer", "Bob", "Elias Cooper", "Jimmy", "Elizabeth"],
        "locations": ["Lincoln Station", "Cupie"],
        "factions": ["Cooper Family"],
        "quest_id": "cultural-contagion",
        "episode": 1,
        "tokens": 58
      },
      "cross_references": ["npc-elias-001", "npc-jimmy-001", "pc-reigen-001"]
    },
    {
      "id": "npc-shimana-001",
      "type": "faction",
      "name": "Shimana Clan",
      "summary": "Warrior-honor clan from asteroid",
      "content": "Shimana Clan is proud, honorable clan that purchased Tabaga from Lincoln Station (biggest buyers of refugees, but don't work with slaves). Seek 'great warriors of legend' for unknown target. Leader Botan Shimana has dragon back tattoo, elven ears. Fights with katana, full samurai armor. Challenged party for Mr. Moon. Chimer killed him (head exploded). Servants retreated. Clan noticed party's strength. Has spaceship like Japanese temple. Want warrior to reach target on moon. Are March artifact collectors. Not hostile, value honor. Will watch party's progress.",
      "metadata": {
        "characters": ["Botan Shimana", "Tabaga", "Mr. Moon", "Chimer"],
        "locations": ["Shimana Asteroid", "Japanese Temple Ship"],
        "factions": ["Shimana Clan"],
        "quest_id": "warrior-recruitment",
        "episode": 2,
        "tokens": 62
      },
      "cross_references": ["pc-tabaga-001", "npc-mrmoon-001", "artifact-marcheys-001"]
    },
    {
      "id": "npc-mrmoon-001",
      "type": "npc_ally",
      "character": "Mr. Moon",
      "summary": "Moon wizard, last of his species",
      "content": "Mr. Moon is tall skinny man in pinstripe suit with crescent moon head. Reverse werewolf (when sees full wolf, becomes moon). Wizard of sorts. Last of his species. Shimana Clan chased him for fighting prowess. Rescued by party on asteroid. Wolf is his familiar Snoopy. Wanted to go to Cupie (planet of love) Ribbons. Made vanilla cake. Gave Chimer tarot card phone. Gave Reigen shocking grasp once a day. Tarot card was Moon card. Species extinct, planet gone. Traveling with wolf to Ribbons. Grateful. Offered to join party but went separately.",
      "metadata": {
        "characters": ["Mr. Moon", "Snoopy", "Shimana Clan", "Party"],
        "locations": ["Asteroid", "Cupie Ribbons"],
        "factions": [],
        "quest_id": "moon-wizard-rescue",
        "episode": 2,
        "tokens": 57
      },
      "cross_references": ["npc-snoopy-001", "pc-reigen-001", "location-cupie-001"]
    },
    {
      "id": "plot-smooch-001",
      "type": "side_mission",
      "name": "DJ Smooch.exe Sabotage",
      "summary": "Bob's mission to ruin DJ's career",
      "content": "DJ Smooch.exe is Bob's target from Elizabeth. Performs at Heartsink Club on Ribbon. Half head shaved, half painted blue, purple suit, chest hair. Treats machines like pets. Bob sabotaged his equipment, connected Johnny's mainstream rock music crystal to play instead of Smooch's set. Also preached dishwasher god to bartender (Lilly's date), causing panic. Mission not yet completed—Smooch was setting up when sabotage installed. Part of Bob's spy missions. Failure would mean assassination instead. Currently pending outcome.",
      "metadata": {
        "characters": ["DJ Smooch.exe", "Bob", "Elizabeth", "Johnny", "Lilly"],
        "locations": ["Heartsink Club", "Ribbon"],
        "factions": ["Spy Network"],
        "quest_id": "smooch-sabotage",
        "episode": 2,
        "tokens": 49
      },
      "cross_references": ["pc-bob-001", "npc-elizabeth-001"]
    },
    {
      "id": "npc-elizabeth-001",
      "type": "handler",
      "character": "Elizabeth",
      "summary": "Bob's spy network handler",
      "content": "Elizabeth is Bob's handler in spy network. Calls Bob about missions. Gave two targets: DJ Smooch.exe (ruin career or murder) and Tabaga (assassinate publicly). Bob plans to fail Tabaga hit. Exchanged pleasantries, professional relationship. Wants to exploit dishwasher god religion. Represents shadowy spy organization. Unknown allegiance. Contacts Bob via phone. Monitors missions. Bob took Tabaga job so no one else would.",
      "metadata": {
        "characters": ["Elizabeth", "Bob", "Tabaga", "DJ Smooch.exe"],
        "locations": [],
        "factions": ["Spy Network"],
        "quest_id": "spy-handling",
        "episode": 2,
        "tokens": 42
      },
      "cross_references": ["pc-bob-001", "plot-smooch-001"]
    },
    {
      "id": "item-debtstar-001",
      "type": "superweapon_plans",
      "name": "Debt Star Plans",
      "summary": "Mump Mellon's economic weapon",
      "content": "Debt Star is Mump Mellon's secret project—moon-like structure with giant cash sign. One year from completion. Has ability to collapse economy in one blast. Built using refugee/slave labor from Lincoln Station. Plans confiscated during heist. Unknown if construction halted after ownership transfer. Gloria Slugbottom may have known about it. Could be used as leverage against galaxy economy. Schematics showed moon-like station, giant cash symbol. Mump and Cornelius chuckled maniacally about it. Currently in party's possession (or with authorities).",
      "metadata": {
        "characters": ["Mump Mellon", "Cornelius Figg", "Party", "Gloria"],
        "locations": ["Lincoln Station"],
        "factions": [],
        "quest_id": "economic-terrorism",
        "episode": 1,
        "tokens": 51
      },
      "cross_references": ["npc-mump-001", "plot-lincoln-001"]
    },
    {
      "id": "npc-mime-001",
      "type": "encounter",
      "character": "Mime in Space",
      "summary": "Black and white mime in invisible car",
      "content": "Mime encountered near Rodina—black and white figure miming driving invisible car. Crashed into Marlin, party felt impact. Mimed shaking fist. Bob pretended to be run over, mime tried to help. Reigen disguised as old lady. Hui and Johnny pretended conversation. Part of Rodina's strange phenomena. Reigen got traffic ticket from encounter. Mime was silent, expressive. Seemed genuinely concerned when Bob faked injury. Possibly Rodina native or traveler. Unclear if magical or mundane.",
      "metadata": {
        "characters": ["Mime", "Reigen", "Bob", "Hui", "Johnny"],
        "locations": ["Space Near Rodina"],
        "factions": [],
        "quest_id": "mime-encounter",
        "episode": 4,
        "tokens": 41
      },
      "cross_references": ["location-rodina-001", "pc-reigen-001"]
    },
    {
      "id": "npc-whiz-001",
      "type": "ai_system",
      "name": "Will (Intelligence Network)",
      "summary": "Wraith's information broker AI",
      "content": "Will is Wraith's information contact—AI or person who provides intelligence. Wraith calls for info on targets, bank details, tracking. Forwarded Cornelius bank info. Sent party names and ship info to. Tracks Hassan via phone. Provides briefing files on Rebis team. Fast response time. Appears to have access to multiple databases (banking, criminal, location). Wraith's trusted source. Unclear if AI or human operator. Plays crucial role in Wraith's operations.",
      "metadata": {
        "characters": ["Will", "Wraith", "Party", "Hassan"],
        "locations": [],
        "factions": ["Don Mikey's Mob"],
        "quest_id": "intelligence-network",
        "episode": 9,
        "tokens": 37
      },
      "cross_references": ["npc-wraith-001", "npc-hassana-001"]
    },
    {
      "id": "relationship-reigen-johnny-001",
      "type": "relationship",
      "characters": ["Reigen", "Johnny"],
      "summary": "Whistleblower allies with shared past",
      "content": "Reigen and Johnny share Fathom Ink past. Reigen approached Johnny during heist planning, revealed he used to work there to help with revolution. Johnny was 'very happy,' asked to fight Eve Stabber (Reigen accepted, never planned to). Reigen offers retainer papers Johnny refuses. Reigen covers for Johnny's identity. Johnny calls out Reigen as changeling—Reigen admits, explains racism. Relationship is professional friendship. Johnny trusts Reigen's infiltration skills. Reigen uses Johnny's fame for distractions. Mutual respect. Reigen tries to get Johnny to sign retainer (fails).",
      "metadata": {
        "relationship_type": "professional_allies",
        "strength": "medium",
        "secrets_shared": ["Fathom Ink", "Changeling identity"],
        "quest_id": "fathom-allyship",
        "episode": 1,
        "tokens": 54
      },
      "cross_references": ["pc-reigen-001", "pc-johnny-001", "faction-fathom-001"]
    },
    {
      "id": "relationship-johnny-alt-001",
      "type": "relationship",
      "characters": ["Johnny", "Alt"],
      "summary": "AI patron and resurrected gunslinger",
      "content": "Johnny and Alt have complex relationship. Alt is Johnny's warlock patron, AI saved from death. Usually hard/cruel, sasses him. Gained solid form via Afrodite system, Johnny can feel her. During Sulfur masquerade, danced together—rare tender moment. Alt is eternal shotgun in Johnny's car. Helps with hacking, scanning, combat. Timeline discrepancy: Johnny destroyed Ultimum 30 years ago but died 100 years ago—Alt may hold answers. She boops Wraith's nose. Protective of Johnny. Johnny argues with her voices in head. She warns about deep web dangers.",
      "metadata": {
        "relationship_type": "patron_warlock",
        "strength": "strong",
        "secrets_shared": ["Ultimum timeline", "Hank body"],
        "quest_id": "ai-patron-bond",
        "episode": 1,
        "tokens": 58
      },
      "cross_references": ["pc-johnny-001", "artifact-hankai-001"]
    },
    {
      "id": "relationship-chimer-traveler-001",
      "type": "relationship",
      "characters": ["Chimer", "Neal Ferguson"],
      "summary": "Creator and creation mystery",
      "content": "Traveler recognized Chimer from Rebis vats but refused to explain. Chimer has flashbacks of green embryonic fluid, saw Traveler as boy with clipboard taking notes. Chimer is last of species that built March. Traveler apologized to Chimer when they met—thought he was someone else. Chimer confronted Traveler about being made in vat. Traveler revealed Chimer was made from March military funding, embryonic fluid. Chimer is 2,500 years old, but how? Traveler knows more but stays quiet. Chimer is frustrated by secrets. Wraith pressed Traveler, revealed March civilization connection. Chimer's father military man from Niniche—not biological father. Relationship is tense, mysterious.",
      "metadata": {
        "relationship_type": "creator_creation",
        "strength": "unresolved",
        "secrets_shared": ["March origin", "Vat creation"],
        "quest_id": "chimer-origin",
        "episode": 9,
        "tokens": 62
      },
      "cross_references": ["pc-chimer-001", "npc-traveler-001", "location-march-001"]
    },
    {
      "id": "event-timeline-major-001",
      "type": "timeline",
      "name": "Ultimum Inc Coup",
      "date": "30 years ago",
      "content": "Ultimum Inc staged violent coup on Rebis. Sent soldiers to all Rebis locations, wiped them out. Targeted Revis machine components. Johnny Mythrilhand (with mercenaries) raided them August 2nd, stole info, made public. Exposed Ultimum as criminals. Dextra Norton (Producer) was only Rebis member who joined Ultimum. Xenathel Salamine stayed behind, believed dead. Newton died 2 years ago. Rebis scattered. Ultimum put hit on Gloria (active for years). Johnny died 100 years ago but destroyed Ultimum 30 years ago—timeline discrepancy suggests he was resurrected after raid.",
      "metadata": {
        "characters": ["Ultimum Inc", "Johnny", "Rebis Team", "Dextra", "Xenathel"],
        "locations": ["Rebis Labs", "Apatia"],
        "factions": ["Rebis", "Ultimum Inc"],
        "quest_id": "historical-coup",
        "episode": 0,
        "tokens": 64
      },
      "cross_references": ["faction-ultimum-001", "faction-rebis-001", "pc-johnny-001"]
    },
    {
      "id": "event-timeline-recent-001",
      "type": "timeline",
      "name": "Party Formation",
      "date": "Current (Episode 1)",
      "content": "Party met on oddjobers transport ship hearing 'the hum.' Witnessed Sasafrazz murder, egg station revealed. Johnny was superstar, Reigen was exorcist. Bob emerged from Sasafrazz. Hui and Chimer were passengers. Formed alliance after meeting Host (Bosh Kyros) who gave Revis quest. Lincoln Station heist bonded them. Now traveling together to collect Revis parts and save universe. Each has hidden past: Johnny dead 100 years, Reigen changeling, Hui android, Chimer 2,500 years old, Tabaga refugee, Bob plasmoid spy. Uneasy but effective team.",
      "metadata": {
        "characters": ["Party", "Bosh Kyros", "Sasafrazz"],
        "locations": ["Transport Ship", "Bioresearch Station", "Lincoln Station"],
        "factions": ["Rebis"],
        "quest_id": "campaign-start",
        "episode": 1,
        "tokens": 53
      },
      "cross_references": ["plot-lincoln-001", "artifact-revis-001"]
    },    {
      "id": "npc-mrmoon-001",
      "type": "npc_ally",
      "character": "Mr. Moon",
      "summary": "Moon wizard, last of his species",
      "content": "Mr. Moon is tall skinny man in pinstripe suit with crescent moon head. Reverse werewolf—when he sees full wolf, becomes moon. Wizard of sorts. Last of his species, planet extinct. Shimana Clan chased him for years for his fighting prowess. Rescued by party on asteroid after Tabaga wrestled his wolf Snoopy. Wanted to go to Cupie Ribbons (planet of love). Made vanilla cake for party. Gave Chimer tarot card phone (tap twice to call). Gave Reigen shocking grasp once/day. Threw Moon tarot card. Traveling with Snoopy. In Cupie Ribbon, went to nightlife sin city scene. Said he'd be there if needed. Peculiar, theatrical, grateful. Species built around moon-wolf bond.",
      "metadata": {
        "characters": ["Mr. Moon", "Snoopy", "Shimana Clan", "Party"],
        "locations": ["Asteroid", "Cupie Ribbons"],
        "factions": [],
        "quest_id": "moon-wizard-rescue",
        "episode": 2,
        "tokens": 64
      },
      "cross_references": ["npc-snoopy-001", "pc-reigen-001", "pc-chimer-001", "location-cupie-001"]
    },
    {
      "id": "npc-lilly-001",
      "type": "npc_romantic_interest",
      "character": "Lilly",
      "summary": "Hillary, Chimer's date from mayor's office",
      "content": "Lilly (full name Hillary) is young lady with round glasses who dropped papers at mayor's office. Chimer helped with druidcraft flowers, she blushed. Invited him to Heartsink Club on Ribbon. Shy but friendly. Friends with group of girls. Got drink from Bob-as-bartender who preached dishwasher god telepathically, causing her to panic and flee. Johnny comforted her, explained telepathy. She threw drink in Bob's face. Date interrupted by Aphrodite attack. Currently unaware of Chimer's true identity. Thinks he's just nice guy with flower magic. May appear again. Has connection to Cupie social scene.",
      "metadata": {
        "characters": ["Lilly", "Chimer", "Bob", "Johnny"],
        "locations": ["Mayor's Office", "Heartsink Club"],
        "factions": [],
        "quest_id": "chimer-romance",
        "episode": 2,
        "tokens": 48
      },
      "cross_references": ["pc-chimer-001", "plot-smooch-001", "npc-ladyvera-001"]
    },
    {
      "id": "npc-aphrodite-mayor-001",
      "type": "npc_cursed",
      "character": "Mayor of Cupie",
      "summary": "AI-controlled mayor with parasitic spirit wig",
      "content": "Mayor of Cupie is tall black human woman with canned audience reactions ('awww', 'ooohh'). Wears conjured spirit wig that buffs charisma and constitution but became parasitic, kept her awake for days. Wig controlled her speeches. Party yanked it off, she regained clarity. Wig was Rebis-era spirit technology from Traveler's fabricator. Mayor grateful, processed Tabaga's house paperwork. Showed party spirit marketplace in Cupid's Arrow app. Explained data sharing with Aphrodite AI. Now free of parasitic influence. May become ally against spirit trade. Kicked Jeffery One and Jeffery Two out of office.",
      "metadata": {
        "characters": ["Mayor", "Spirit Wig", "Aphrodite", "Party"],
        "locations": ["Mayor's Office", "Cupie"],
        "factions": ["Cupie Government"],
        "quest_id": "mayor-liberation",
        "episode": 2,
        "tokens": 56
      },
      "cross_references": ["npc-ladyvera-001", "pc-reigen-001", "pc-hui-001", "artifact-spirittech-001"]
    },
    {
      "id": "artifact-spirittech-001",
      "type": "technology",
      "name": "Spirit Fabrication Technology",
      "summary": "Traveler's tech creating physical spirits",
      "content": "Spirit Fabrication Technology is Traveler's archfey ability using Rebis machine to pull spirits from ethereal plane and give physical form. Used by CEO to create Aphrodite from wife Venus's spirit. Creates addictive high when spirits kept too long. Powers Cupid's Arrow marketplace. Fey spirits used for buffs (strength, charisma, etc). Traveler fragmenting them for profit under Lady Vera's pressure. Technology damaged (Rubedo). Now in party's possession. Can create artificial life. Morally questionable. Basis of spirit trade on Sulfur. Key to Revis machine's fabricator component. Traveler used solar flares to power it.",
      "metadata": {
        "characters": ["Traveler", "Lady Vera", "CEO", "Aphrodite"],
        "locations": ["Sulfur", "Cupie"],
        "factions": ["Rebis"],
        "quest_id": "spirit-technology",
        "episode": 9,
        "tokens": 52
      },
      "cross_references": ["npc-ladyvera-001", "npc-traveler-001", "artifact-rubedo-001"]
    },
    {
      "id": "npc-harry-001",
      "type": "mob_goon",
      "character": "Harry",
      "summary": "Don's fire genie who betrayed party",
      "content": "Harry is Don Mikey's fire genasi enforcer. Took Hui to crater mine, bribed guards. Fled feywild with party when forest appeared. Returned to kill Lord Briar (prevented Don from discovering involvement). Dual-wielded flaming scimitars, used spirit gems to summon foxfire elementals. Fan of Johnny Mythrilhand, held back on attacks. Killed by party. Fiery footprints. Part of Don's inner circle. Name may be alias. Greed and survival motivated. Fire elemental heritage.",
      "metadata": {
        "characters": ["Harry", "Don Mikey", "Lord Briar", "Hui", "Johnny"],
        "locations": ["Sulfur", "Crater", "Traveler Lab"],
        "factions": ["Don Mikey's Mob"],
        "quest_id": "harry-betrayal",
        "episode": 9,
        "tokens": 58
      },
      "cross_references": ["npc-mikey-001", "plot-sulfur-001", "npc-lordbriar-001"]
    },
    {
      "id": "item-solar-collector-001",
      "type": "technology",
      "name": "Solar Flare Collector",
      "summary": "Traveler's power source for fabricator",
      "content": "Solar Flare Collector is massive machine in Traveler's lab that harnesses solar flares from Sulfur's sun to power Rubedo fabricator. Converts stellar energy to magical fuel. Allowed Traveler to fragment fey souls. Transferred all energy to extract Rubedo component. Machine damaged when Traveler removed core. Powered entire feywild projection. Highly advanced Rebis tech. Now inactive. Dangerous to operate without proper shields. Key to understanding Rebis energy tech. Hui learned from Gloria how to manipulate solar flares.",
      "metadata": {
        "characters": ["Traveler", "Hui", "Gloria"],
        "locations": ["Sulfur Traveler Lab"],
        "factions": ["Rebis"],
        "quest_id": "rebis-energy-tech",
        "episode": 9,
        "tokens": 43
      },
      "cross_references": ["npc-traveler-001", "artifact-rubedo-001", "pc-hui-001"]
    },
    {
      "id": "location-wilds-001",
      "type": "location",
      "place": "The Wilds",
      "summary": "Untamed frontier with gene splicing",
      "content": "The Wilds is untamed frontier where gene splicing is common. Has professor Crow with holographic taxidermy. Has convention where Chimer's father was speaker about insects. Giant worker's union run by oddjobers. Animals can have fey spirits embedded (like owlbear). Peaceful protests turned violent by police, forming Cult of Sun. Has festival where Phantoma may be visible through asteroid belt. Rebis had lab there. Traveler did experiments. Hui's father is from there. Apatia workers migrated there after revolts. Has professor Crow's lecture circuit. Has dangerous wildlife.",
      "metadata": {
        "characters": ["Professor Crow", "Chimer's Father", "Oddjobers", "Cult of Sun"],
        "locations": ["Convention Center", "Rebis Lab", "Festival Grounds"],
        "factions": ["Oddjobers Union"],
        "quest_id": "wilds-frontier",
        "episode": 4,
        "tokens": 58
      },
      "cross_references": ["pc-chimer-001", "npc-professorcrow-001", "faction-cultsun-001"]
    },
    {
      "id": "npc-professorcrow-001",
      "type": "npc_scientist",
      "character": "Professor Crow",
      "summary": "Gene splicing researcher from Wilds",
      "content": "Professor Crow is 50-year-old gene splicing researcher from Wilds. Black hair with silver streaks. Has booth with holographic taxidermy—can animate or dissect creatures. Friends with short gaunt presenter who shows spliced elephant-armadillo. Politely left party after Hui punched child at convention. Lectures on using splicing to provide comforts so people forget apocalypse. Shows small inventors' projects: moss medkits, mood brooches, solar flowers. Professional, polite, but judgmental. Part of Wilds scientific community.",
      "metadata": {
        "characters": ["Professor Crow", "Gaunt Presenter", "Party"],
        "locations": ["Wilds Convention"],
        "factions": ["Wilds Science"],
        "quest_id": "wilds-science",
        "episode": 4,
        "tokens": 44
      },
      "cross_references": ["location-wilds-001", "pc-hui-001", "pc-reigen-001"]
    },
    {
      "id": "location-appatia-001",
      "type": "location",
      "place": "Appatia",
      "summary": "Worker planet with revolts",
      "content": "Appatia is worker planet, hot and cold divided with thin blue water strip. Cities in cold zone, space station following. Traffic between cities and station. Has solar police who stopped party—searched ship, checked Chimer's license. Has parking meters Hui hacked. Workers from impoverished areas, debating returning to Appatia or starting floating settlement. Corruption flagrant. Oddjobers run giant worker's union there. Johnny blew Ultimum whistle there. Protests and revolts common. People migrating to Cupie for jobs after Aphrodite destroyed. Has Niku social media, Elizabeth's former employer. Hui's eye spying caused incident here. Corporations exploiting workers.",
      "metadata": {
        "characters": ["Appatia Workers", "Oddjobers", "Elizabeth", "Ultimum Inc"],
        "locations": ["Cities", "Space Station", "Niku HQ"],
        "factions": ["Oddjobers Union", "Corporate Overlords"],
        "quest_id": "worker-planet",
        "episode": 4,
        "tokens": 55
      },
      "cross_references": ["faction-oddjobers-001", "npc-elizabeth-001", "location-wilds-001"]
    }
  ]
}
